lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Lights/ZigbeeHaOnOffPorchLight/ZigbeeHaOnOffPorchLight.ino
struct PendingApsAck {
  bool active = false;
  uint16_t destinationShort = 0U;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t retriesRemaining = 0U;
  uint8_t payloadLength = 0U;
  uint8_t payload[96] = {0U};
  uint32_t deadlineMs = 0U;
};

struct RecentInboundAps {
  bool valid = false;
  uint16_t sourceShort = 0U;
  uint8_t counter = 0U;
  uint16_t clusterId = 0U;
  uint16_t profileId = 0U;
  uint8_t destinationEndpoint = 0U;
  uint8_t sourceEndpoint = 0U;
  uint8_t deliveryMode = 0U;
  uint32_t expiresMs = 0U;
};

static constexpr uint8_t kPendingApsAckSlots = 3U;
static PendingApsAck g_pendingApsAcks[kPendingApsAckSlots]{};
static RecentInboundAps g_recentInboundAps{};
static constexpr uint32_t kApsAckTimeoutMs = 900U;
static constexpr uint32_t kRecentInboundApsWindowMs = 4000U;
static constexpr uint8_t kApsAckRetryLimit = 2U;
static constexpr uint32_t kParentRxTurnaroundDelayUs = 6000U;
static constexpr uint8_t kSleepyEndDeviceCapability = 0xC4U;

void armInterviewGraceWindow();
bool interviewGraceActive(uint32_t nowMs);
void maybeReceiveDirectInterviewTraffic(uint32_t nowMs);
static bool g_transportCoordinatorPollToggle = false;

void clearPendingApsAck();
void clearPendingApsAckSlot(uint8_t slot);
void clearRecentInboundAps();
void printEnergyDetectSweep();

ZigbeeCommissioningPolicy commissioningPolicy() {
  ZigbeeCommissioningPolicy policy{};
  policy.primaryChannelMask =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_PRIMARY_CHANNEL_MASK);
  policy.secondaryChannelMask =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_SECONDARY_CHANNEL_MASK);
  policy.activeScanWindowMs =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_ACTIVE_SCAN_WINDOW_MS);
  policy.associationResponseTimeoutMs = static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_RESPONSE_TIMEOUT_MS);
  policy.associationPollListenMs =
      static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_POLL_LISTEN_MS);
  policy.associationPollRetryDelayMs = static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_ASSOCIATION_POLL_RETRY_DELAY_MS);
  policy.coordinatorRealignmentTimeoutMs = static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_COORDINATOR_REALIGNMENT_TIMEOUT_MS);
  policy.nwkRejoinResponseTimeoutMs = static_cast<uint32_t>(
      NRF54L15_CLEAN_ZIGBEE_NWK_REJOIN_RESPONSE_TIMEOUT_MS);
  policy.preferredPanId = kPreferredPanId;
  policy.preferredExtendedPanId =
      (g_extendedPanId != 0U) ? g_extendedPanId
                              : kConfiguredPreferredExtendedPanId;
  policy.pinnedTrustCenterIeee =
      static_cast<uint64_t>(NRF54L15_CLEAN_ZIGBEE_TRUST_CENTER_IEEE);
  policy.allowWellKnownKey = (NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY != 0);
  policy.allowInstallCodeKey = (NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE != 0);
  policy.installCodeOnly =
      (NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE != 0) &&
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_WELL_KNOWN_LINK_KEY == 0);
  policy.requireEncryptedTransportKey =
      (NRF54L15_CLEAN_ZIGBEE_REQUIRE_ENCRYPTED_TRANSPORT_KEY != 0);
  policy.requireEncryptedUpdateDevice =
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS == 0);
  policy.requireEncryptedSwitchKey =
      (NRF54L15_CLEAN_ZIGBEE_ALLOW_DEMO_PLAINTEXT_TC_CMDS == 0);
  policy.requirePanCoordinator =
      (NRF54L15_CLEAN_ZIGBEE_REQUIRE_PAN_COORDINATOR != 0);
  policy.requireUniqueTrustCenterForRejoin = true;
  return policy;
}

void refreshCommissioningState() {
  g_network.policy = commissioningPolicy();
  g_network.preferredChannel = kPreferredChannel;
  g_network.preferredPanId = kPreferredPanId;
  g_network.defaultShort = kTempShort;
  g_network.coordinatorShort = kCoordinatorShort;
}

bool loadInstallCodeLinkKey(uint8_t outKey[16]) {
#if NRF54L15_CLEAN_ZIGBEE_USE_INSTALL_CODE
  return ZigbeeSecurity::deriveInstallCodeLinkKey(kInstallCode,
                                                  sizeof(kInstallCode), outKey);
#else
  (void)outKey;
  return false;
#endif
}

uint64_t expectedTrustCenterIeee() {
  refreshCommissioningState();
  return ZigbeeCommissioning::expectedTrustCenterIeee(g_network);
}

void applyDefaultReporting() {
  g_device.configureReporting(kZigbeeClusterOnOff, 0x0000U,
                              ZigbeeZclDataType::kBoolean, 0U, 30U, 0U);
}

void applyReportingState() {
  if (!g_haveRestoredState || g_restoredState.reportingCount == 0U) {
    applyDefaultReporting();
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.reportingCount && i < 8U; ++i) {
    if (!g_restoredState.reporting[i].used) {
      continue;
    }
    g_device.configureReporting(g_restoredState.reporting[i].clusterId,
                                g_restoredState.reporting[i].attributeId,
                                g_restoredState.reporting[i].dataType,
                                g_restoredState.reporting[i].minimumIntervalSeconds,
                                g_restoredState.reporting[i].maximumIntervalSeconds,
                                g_restoredState.reporting[i].reportableChange);
  }
}

void applyBindingState() {
  if (!g_haveRestoredState || g_restoredState.bindingCount == 0U) {
    return;
  }

  for (uint8_t i = 0U; i < g_restoredState.bindingCount && i < 8U; ++i) {
    if (!g_restoredState.bindings[i].used) {
      continue;
    }
    (void)g_device.addBinding(g_restoredState.bindings[i].sourceEndpoint,
                              g_restoredState.bindings[i].clusterId,
                              g_restoredState.bindings[i].destinationAddressMode,
                              g_restoredState.bindings[i].destinationGroup,
                              g_restoredState.bindings[i].destinationIeee,
                              g_restoredState.bindings[i].destinationEndpoint);
  }
}

void configureDeviceForCurrentNetwork() {
  ZigbeeBasicClusterConfig basic{};
  basic.manufacturerName = NRF54L15_CLEAN_ZIGBEE_BASIC_MANUFACTURER_NAME;
  basic.modelIdentifier = NRF54L15_CLEAN_ZIGBEE_BASIC_MODEL_IDENTIFIER;
  basic.swBuildId = NRF54L15_CLEAN_ZIGBEE_BASIC_SW_BUILD_ID;
  basic.powerSource = 0x01U;
  g_device.configureOnOffLight(kLocalEndpoint, kIeeeAddress, g_localShort, g_panId,
                               basic, 0x0000U);
  applyReportingState();
  applyBindingState();
  g_device.setOnOff(g_savedOnOffState);
}

static bool identifyIndicatorOn(uint32_t nowMs, uint8_t effectIdentifier) {
  switch (effectIdentifier) {
    case kZigbeeIdentifyEffectBlink:
    case kZigbeeIdentifyEffectOkay:
      return ((nowMs / 150U) & 0x01UL) == 0U;
    case kZigbeeIdentifyEffectBreathe:
      return ((nowMs % 1200U) < 800U);
    case kZigbeeIdentifyEffectChannelChange:
      return ((nowMs / 75U) & 0x01UL) == 0U;
    case kZigbeeIdentifyEffectFinishEffect:
      return true;
    default:
      return ((nowMs / 250U) & 0x01UL) == 0U;
  }
}

void applyLedState() {
  const uint32_t nowMs = millis();
  g_device.updateIdentify(nowMs);
  const bool ledOn =
      g_device.identifying()
          ? identifyIndicatorOn(nowMs, g_device.identifyEffect())
          : g_device.onOff();
  Gpio::write(kPinUserLed, !ledOn);
}

void clearActiveNetworkKey() {
  memset(g_activeNetworkKey, 0, sizeof(g_activeNetworkKey));
  g_activeNetworkKeySequence = 0U;
  g_haveActiveNetworkKey = false;
}

bool persistState() {
  refreshCommissioningState();
  ZigbeePersistentState state{};
  ZigbeeCommissioning::populatePersistentState(
      g_network, kIeeeAddress, ZigbeeLogicalType::kEndDevice,
      g_device.config().manufacturerCode, &state);
  state.onOffState = g_device.onOff();

  const ZigbeeReportingConfiguration* reporting = g_device.reportingConfigurations();
  uint8_t copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!reporting[i].used) {
      continue;
    }
    state.reporting[copied++] = reporting[i];
  }
  state.reportingCount = copied;
  const ZigbeeBindingEntry* bindings = g_device.bindings();
  copied = 0U;
  for (uint8_t i = 0U; i < 8U && copied < 8U; ++i) {
    if (!bindings[i].used) {
      continue;
    }
    state.bindings[copied++] = bindings[i];
  }
  state.bindingCount = copied;
  return g_store.save(state);
}

void restoreState() {
  memset(&g_restoredState, 0, sizeof(g_restoredState));
  g_haveRestoredState = false;
  g_savedOnOffState = false;
  ZigbeeCommissioning::initializeEndDeviceState(&g_network,
                                                commissioningPolicy(),
                                                kPreferredChannel,
                                                kPreferredPanId, kTempShort,
                                                kCoordinatorShort);

