lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/examples/Zigbee/Lights/ZigbeeHaOnOffPorchLight/ZigbeeHaOnOffPorchLight.ino
void armInterviewGraceWindow() {
  g_interviewGraceUntilMs =
      millis() + static_cast<uint32_t>(NRF54L15_CLEAN_ZIGBEE_INTERVIEW_GRACE_MS);
}

bool interviewGraceActive(uint32_t nowMs) {
  if (!g_joined) {
    return false;
  }
  return static_cast<int32_t>(g_interviewGraceUntilMs - nowMs) > 0;
}

void maybeReceiveDirectInterviewTraffic(uint32_t nowMs) {
  if (!interviewGraceActive(nowMs)) {
    return;
  }

  ZigbeeFrame frame{};
  if (!g_radio.receive(
          &frame,
          static_cast<uint32_t>(
              NRF54L15_CLEAN_ZIGBEE_INTERVIEW_DIRECT_LISTEN_US),
          350000UL)) {
    return;
  }
  processIncomingFrame(frame);
}

void handleSerialCommands() {
  while (Serial.available() > 0) {
    const int ch = Serial.read();
    if (ch == 't') {
      g_savedOnOffState = !g_device.onOff();
      g_device.setOnOff(g_savedOnOffState);
      applyLedState();
      persistState();
      Serial.print("toggle onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print("\r\n");
    } else if (ch == 'r') {
      const bool ok = sendAttributeReport(kZigbeeClusterOnOff);
      Serial.print("report ");
      Serial.print(ok ? "OK" : "FAIL");
      Serial.print("\r\n");
    } else if (ch == 'j') {
      const ZigbeeCommissioningStartRequest request =
          requestCommissioningStart();
      if (request == ZigbeeCommissioningStartRequest::kSecureRejoin) {
        Serial.print("secure_rejoin requested\r\n");
      } else if (request ==
                 ZigbeeCommissioningStartRequest::kNetworkSteering) {
        Serial.print("network_steering requested\r\n");
      } else {
        Serial.print("commissioning request ignored\r\n");
      }
    } else if (ch == 'c') {
      clearJoinState(true);
      Serial.print("state cleared\r\n");
    } else if (ch == 's') {
      Serial.print("state joined=");
      Serial.print(g_joined ? "yes" : "no");
      Serial.print(" mode=");
      Serial.print(ZigbeeCommissioning::stateName(g_network.state));
      Serial.print(" failure=");
      Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
      Serial.print(" join_attempts=");
      Serial.print(g_network.joinAttempts);
      Serial.print(" rejoin_attempts=");
      Serial.print(g_network.rejoinAttempts);
      Serial.print(" ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print(" parent=0x");
      Serial.print(g_parentShort, HEX);
      Serial.print(" coord=0x");
      Serial.print(g_network.coordinatorShort, HEX);
      Serial.print(" nwk_seq=");
      Serial.print(g_haveActiveNetworkKey ? g_activeNetworkKeySequence : 0U);
      Serial.print(" alt_seq=");
      Serial.print(g_haveAlternateNetworkKey ? g_alternateNetworkKeySequence
                                             : 0U);
      Serial.print(" poll_ms=");
      Serial.print(g_parentPollIntervalMs);
      Serial.print(" onoff=");
      Serial.print(g_device.onOff() ? "ON" : "OFF");
      Serial.print("\r\n");
    }
  }
}


}  // namespace

void setup() {
  Serial.begin(115200);
  delay(300);

  if (g_localIeee == 0U) {
    g_localIeee = zigbeeFactoryEui64();
  }

  Gpio::configure(kPinUserLed, GpioDirection::kOutput, GpioPull::kDisabled);
  g_store.begin("zbjoinlt");
  restoreState();

  const bool ok = g_radio.begin(g_channel, 8);
  Serial.print("\r\nZigbeeHaOnOffLightJoinable start\r\n");
  Serial.print("radio=");
  Serial.print(ok ? "OK" : "FAIL");
  Serial.print(" preferred_channel=");
  Serial.print(kPreferredChannel);
  Serial.print(" ieee=0x");
  Serial.print(static_cast<uint32_t>(kIeeeAddress >> 32U), HEX);
  Serial.print(static_cast<uint32_t>(kIeeeAddress & 0xFFFFFFFFUL), HEX);
  Serial.print(" joined=");
  Serial.print(g_joined ? "yes" : "no");
  Serial.print("\r\n");
  if (ok) {
    printEnergyDetectSweep();
  }
  Serial.print("serial commands: t=toggle r=report s=status j=rejoin c=clear\r\n");

  if (g_joined) {
    g_radio.setChannel(g_channel);
  }
}

void loop() {
  handleSerialCommands();

  const uint32_t now = millis();
  if (g_network.state != g_lastLoggedCommissionState ||
      g_network.lastFailure != g_lastLoggedCommissionFailure) {
    g_lastLoggedCommissionState = g_network.state;
    g_lastLoggedCommissionFailure = g_network.lastFailure;
    Serial.print("commission state=");
    Serial.print(ZigbeeCommissioning::stateName(g_network.state));
    Serial.print(" failure=");
    Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
    Serial.print(" joined=");
    Serial.print(g_joined ? "yes" : "no");
    Serial.print(" rejoin=");
    Serial.print(g_rejoinPending ? "yes" : "no");
    Serial.print("\r\n");
  }
  const ZigbeeCommissioningAction action =
      ZigbeeCommissioning::nextAction(&g_network, now);
  const uint32_t effectivePollIntervalMs =
      interviewGraceActive(now) ? min(g_parentPollIntervalMs, 250UL)
                                : g_parentPollIntervalMs;
  if (!g_joined) {
    clearPendingApsAck();
    clearRecentInboundAps();
    if (action == ZigbeeCommissioningAction::kPollParent &&
        (now - g_lastPollMs) >= 250U) {
      g_lastPollMs = now;
      pollCoordinator();
    } else if (action == ZigbeeCommissioningAction::kSecureRejoin) {
      Serial.print("secure_rejoin start\r\n");
      if (performSecureRejoin()) {
        Serial.print("secure_rejoin OK ch=");
      } else {
        Serial.print("secure_rejoin MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print(" parent=0x");
      Serial.print(g_parentShort, HEX);
      Serial.print(" coord=0x");
      Serial.print(g_network.coordinatorShort, HEX);
      Serial.print("\r\n");
    } else if (action == ZigbeeCommissioningAction::kJoin) {
      Serial.print("scan_join start\r\n");
      if (!performJoin()) {
        Serial.print("join MISS failure=");
        Serial.print(ZigbeeCommissioning::failureName(g_network.lastFailure));
        Serial.print("\r\n");
        delay(1);
        return;
      }
      Serial.print("join OK ch=");
      Serial.print(g_channel);
      Serial.print(" pan=0x");
      Serial.print(g_panId, HEX);
      Serial.print(" short=0x");
      Serial.print(g_localShort, HEX);
      Serial.print(" parent=0x");
      Serial.print(g_parentShort, HEX);
      Serial.print(" coord=0x");
      Serial.print(g_network.coordinatorShort, HEX);
      Serial.print("\r\n");
    }
    delay(1);
    return;
  }

